import math

def task():
    c = 2.0
    l = 0.5
    print("=" * 50)
    print("Тема 4.2. Электромагнитные колебания и волны."
          "\nЗАДАЧА 1: Расчет периода и частоты колебаний.")
    print("=" * 50)
    print("ДАНО:")
    print(f"• Емкость C = {c} мкФ")
    print(f"• Индуктивность L = {l} Гн")
    print("НАЙТИ:"
          "\n• Период T собственных колебаний."
          "\n• Частоту v.")
    print("=" * 50)
    print("                    РЕШЕНИЕ")
    print("=" * 50)
    t = 2 * math.pi * math.sqrt(l * (c * 1e-6))
    v = 1 / t
    print(f"Период: {t:.5f} с")
    print(f"Частота: {v:.2f} Гц")


task()